// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
Console.WriteLine("Vvedite chislo");

            int a;
           
             a = Convert.ToInt32(Console.ReadLine());

            for (int i=0; i<a; i++)
           {
            Console.WriteLine(i);
            i++;
           
           }